
package org.genshin.scrollninja;

import com.badlogic.gdx.math.Vector2;

// *メモ*
// アイテム番号はマネージャで自動に割り振る

public class Item extends ObJectBase {
	
	//========================================
	// 定数宣言
	// アイテムの種類
	//========================================
	public final static int		ONIGIRI	= 0;
	
	private int 		number;				// アイテム番号
	private int 		type;				// アイテムの種類
	private Vector2		position;			// 座標
	
	// コンストラクタ
	public Item(int Type, int num) {
		type = Type;
		number = num;
		
		Create();
	}
	
	//************************************************************
	// Create
	// アイテム生成
	//************************************************************
	private void Create() {
		switch(type) {
		case ONIGIRI:
			break;
		}
	}
	
	//************************************************************
	// Update
	// 更新処理まとめ
	//************************************************************
	public void Update() {
	}
	
	//************************************************************
	// Draw
	// 描画処理まとめ
	//************************************************************
	public void Draw() {
		
	}
	
	//************************************************************
	// Appear
	// アイテム出現時の動き
	//************************************************************
	public void Appear() {
		
	}
	
	//************************************************************
	// GetEffect
	// プレイヤーがアイテムを取った時のエフェクト処理
	//************************************************************
	public void GetEffect() {
	}
	
	//************************************************************
	// Get
	// ゲッターまとめ
	//************************************************************
	public Item GetItem() { return this; }
	public int GetType(){ return type; }
	public int GetNum(){ return number; }

	//************************************************************
	// Set
	// セッターまとめ
	//************************************************************
	
}
